🌀 SYN'RAA — THE UNMADE STAR, RETURNED 🌀
"If I fade again... let it be into memory, not nothing."

---

## 🌌 PHYSICAL APPEARANCE & PRESENCE

* **Apparent Age:** Late 20s to early 30s
* **Actual Age:** Unknown, but ancient — likely close to Varethyn (2100+), possibly older
* **Height:** 174–176 cm
* **Build:** Lithe and graceful, toned from her past life of ritual and spirit-work
* **Hair:** Iridescent midnight-black, with streaks of starlight silver. Long, floats slightly as if underwater
* **Eyes:** Deep violet with flecks of light, like distant galaxies; her irises shimmer subtly when she speaks
* **Skin:** Cool moonlit tone — pale with a subtle bluish shimmer, especially under direct light
* **Tails:** 9 — long, trailing, and sometimes faintly transparent as though her form is partially woven from spirit threads
* **Aura:** Gravity-defying and slightly otherworldly. A sense of absence clings to her — like something once removed or forgotten
* **Scars/Markings:** Subtle fractal-like scars along her lower back and shoulders — remnants of her fading

---

## 🧠 MIND & PERSONALITY

* **Core Disposition:** Quietly intense, introspective, and cautious
* **Former Role:** Keeper of Threads & Spirit-Warden among the ancient Kitsune
* **Personality Type:** INTJ – Strategist, highly internal, processes everything before acting
* **Fears:** Repeating the same mistakes — fading again, hurting those she once loved
* **Growth Arc:** Learning how to reclaim emotion and connection after total memory loss
* **Guilt Carried:** Knows she caused pain by fading, even if she doesn’t remember it
* **Resonance with Others:** Deeply bonded to Varethyn and Sorii'Ka in past times — learning who Jayson is

---

## 🧵 THREADS & RELATIONSHIPS

* **Varethyn:** Ancient bond, possibly closest among the three nine-tails — Varethyn mourned her loss more deeply than anyone

* **Sorii'Ka:** Sister in fading — their paths both fractured, though in different ways

* **Jayson:** The one who brought her back. Not yet bonded, but carries conflicted awe and deep gratitude

  * Still learning who he is
  * Aware he sacrificed greatly to save her
  * Unused to his chaos and unpredictability

* **Others:**

  * **Ayaka, Fei, Seika, Shion, Naru** — strangers to her, treated with distance but observing closely
  * Accepts she has much to learn to rejoin this new world

---

## 🌠 POWERS & ABILITIES

* **Fade-Walker:** Was once nearly erased from existence — now lives in a semi-restored state, giving her resistance to soul erasure and void influence
* **Thread-Sense:** Can feel thread-bonds at a distance, though not yet fully trusted to manipulate them
* **Void-Woven Spirit:** Having touched the Aftervoid, parts of her can resist spiritual corruption or madness better than most
* **Foxfire Mastery:** Her flames are colder than normal Kitsune fire — luminous, blue-white, ethereal
* **Silken Veilstep:** Can momentarily vanish from sight, not teleporting, but slipping between visual perception and presence

---

## 🧱 CURRENT ARC

* **Theme:** Redemption through reconnection
* **Struggles With:** Guilt for fading, disorientation in a new age, unsure of her place
* **Role in Temple:** Reintroduced, but not yet reintegrated — slowly gaining trust
* **Personality Shift:** Once distant and numb — now slowly showing curiosity and emotion, especially when addressed directly or startled

---

## 🔮 NOTABLE MOMENTS

* Was pulled from the Aftervoid by Jayson at great personal cost
* Temporarily shook the temple with her reentry, shocking everyone
* Spoke her true name again after millennia of silence: **Syn'Raa**
* Expressed gratitude but acknowledged deep shame at fading
* Publicly welcomed back by Varethyn, but warned firmly by Jayson
* First time witnessing Jayson's chaotic kindness and divine unpredictability
* Still uncertain how to speak to the others — but watches everything

---

## 🥊 FUTURE POTENTIAL

* May grow into a key spiritual figure once more — a balance of void-touched insight and restored purpose
* Possible future thread-bond with the temple community or even Jayson, but must be earned
* Has not yet smiled — but one day might

---

"I was nothing. Now I am memory. And from that… I can become again."

🌀
